package com.dating.server.model

/**
 * Created by daishin@gmail.com
 * 18.05.2016.
 */
class ProfileQuestions {

    /**
     * Активна ли ваша духовная жизнь
     * (участие в Таинстве Евхаристии, изучение Священного Писания, молитва и доброделание)?
     */
    var question1: String? = null


    /**
     * Профессия и работа в настоящее время:
     */
    var question2: String? = null


    /**
     * Рассматриваете ли возможность брака с человеком у которого есть дети
     */

    var question3: String? = null


    /**
     * Рассматриваете ли возможность брака с человеком, имеющим интимное прошлое
     */

    var question4: String? = null


    /**
     * Привлекались ли к уголовной ответственности?
     */

    var question5: String? = null


    /**
     * Имеется ли зависимость от алкоголя, наркотиков, игр?
     */

    var question6: String? = null


    /**
     * Вирите ли вы в приметы?
     */
    var question7: String? = null


    /**
     * Любите ли вы активный образ жизни?
     */
    var question9: String? = null

    /*
    Сколько времени в день вы проводите у телевизора? А за компьютером?
     */
    var question10: String? = null


    /**
     * Венчание для вас обязательно, желательно?
     */
    var question14: String? = null

    /**
     * Незарегистрированный брак (сожительство) для вас это:
     */
    var question15: String? = null

    /**
     * Что вы ждёте от брака, какова для вас цель создания семьи?
     */
    var question16: String? = null


    /**
     * Какое значение в семейном благополучии,
     * по вашему представлению, имеет материальный достаток?
     */
    var question17: String? = null


    /**
     * Есть ли у вас ограничения со здоровьем?
     */
    var question18: String? = null


    /**
     * Рассматриваете ли возможность брака с человеком, имеющим ограничения по здоровью?
     */
    var question19: String? = null

}